# Самостоятельно выбрать предметную область.
# Подобрать пару наборов данных разных форматов.
# Создать базу данных минимум на три таблицы.
# Заполнение данных осуществляем из файлов.
# Реализовать выполнение 6-7 запросов к базе данных с выводом результатов в json. Среди них могут быть:
#
# выборка с простым условием + сортировка + ограничение количество
#
# подсчет объектов по условию, а также другие функции агрегации
#
# группировка
#
# обновление данных
#
# В решении необходимо указать:
#
# название и описание предметной области (осмысленное)
#
# SQL для создания таблиц
#
# файлы исходных данных (можно обрезать до такого размера, чтобы влезли в GitHub)
#
# скрипт для инициализации базы данных (создание таблиц)
#
# скрипт для загрузки данных из файлов в базу данных
#
# файл базы данных
#
# скрипт с выполнением запросов к базе данных  
